<?php
//Задание №3 б
$students = [
    'ИТ20' => [
        'Иванов Иван' => 5,
        'Кириллов Кирилл' => 4,
        'Иванов Артем' => 2,
        'Куликов Иван' =>1,
        'Киров Кирилл' => 4,
        'Антонов Артем' => 2,
    ],
    'БАП20' => [
        'Антонов Антон' => 4,
        'Кузьмин Никита' =>3,
        'Гаврилов Дмитрий' =>2,
        'Петров Артем' => 4,
    ]
];


$avg=0;
$spisok = [];
foreach ($students as $group => $groups) {
    foreach ($groups as $students_name => $mark) {
        if ($mark < 3 ){
            $spisok[$group][] = $students_name;
        }
    }
}

echo  "Список студентов на отчисление :";
print_r($spisok );

//попытался сделать с avg, но не сработала функция array_key

